dcl 1 error_info static aligned,
      2 name char(32) aligned init("cobol_gen_driver_"),
      2 message_len fixed bin aligned,
      2 message char(36) aligned;

dcl reserved_wd fixed bin internal static init(1),
    numeric_lit_token fixed bin internal static init(2),
    type_9 fixed bin internal static init(9),
    index_name_token fixed bin internal static init(10),
    eos fixed bin internal static init(19),
    internal_tag fixed bin internal static init(30),
    tag_equivalence fixed bin internal static init(31),
    perform fixed bin internal static init(20),
    compute fixed bin internal static init(40);



/*
P__r_o_c_e_d_u_r_e_s_C__a_l_l_e_d:_
						  */

dcl cobol_alter_perform entry (ptr, fixed bin),
    cobol_reset_r$in_line entry,
    signal_ entry (char(*), ptr, ptr),
    cobol_equate_tag entry (ptr),
    cobol_define_tag entry (fixed bin),
    cobol_define_tag_nc entry (fixed bin, fixed bin),
    cobol_accept_gen entry (ptr),
    cobol_add_gen entry (ptr, fixed bin),
    cobol_alter_gen entry (ptr),
    cobol_call_gen entry (ptr),
    cobol_cancel_gen entry (ptr),
    cobol_close_gen entry (ptr),
    cobol_divide_gen entry (ptr, fixed bin),
    cobol_multiply_gen entry (ptr, fixed bin),
    cobol_subtract_gen entry (ptr, fixed bin),
    cobol_exit_gen entry (ptr),
    cobol_compare_gen entry (ptr),
    cobol_go_gen entry (ptr),
    cobol_move_gen entry (ptr),
    cobol_open_gen entry (ptr),
    cobol_perform_gen entry (ptr),
    cobol_read_gen entry (ptr, fixed bin),
    cobol_gen_ioerror$finish_up_not entry(fixed bin),
    cobol_delete_gen entry (ptr, fixed bin),
    cobol_receive_gen entry (ptr, fixed bin),
    cobol_release_gen entry (ptr),
    cobol_return_gen entry (ptr, fixed bin),
    cobol_rewrite_gen entry (ptr, fixed bin),
    cobol_arithop_gen entry (ptr),
    cobol_send_gen entry (ptr),
    cobol_set_gen entry (ptr),
    cobol_stop_gen entry (ptr),
    cobol_write_gen entry (ptr, fixed bin),
    cobol_compute_gen entry (ptr, fixed bin),
    cobol_disable_gen entry (ptr),
    cobol_display_gen entry (ptr),
    cobol_enable_gen entry (ptr),
    cobol_sort_gen entry (ptr),
	cobol_merge_gen entry(ptr),
	cobol_profile entry,
    cobol_prologue_gen entry (ptr, fixed bin, fixed bin, fixed bin, fixed bin),			
    cobol_decl_gen entry (fixed bin),
    cobol_section_gen entry (ptr),
    cobol_paragraph_gen entry (ptr),
    cobol_start_gen entry (ptr, fixed bin),
    cobol_pool entry(char(*),fixed bin,fixed bin),
    cobol_read_rand$fixed_bin entry(fixed bin,fixed bin,ptr),
    cobol_seginit_gen entry (fixed bin, fixed bin),
    cobol_search_gen entry (ptr, fixed bin),
    cobol_inspect_gen entry (ptr),
    cobol_string_gen entry (ptr, fixed bin),
    cobol_unstring_gen entry (ptr, fixed bin),
    cobol_purge_gen entry (ptr),
    cobol_end_gen entry (ptr, fixed bin, fixed bin, fixed bin, fixed bin);


/*
B__u_i_l_t-__i_n_F__u_n_c_t_i_o_n_s_U__s_e_d:_
						  */

dcl addr builtin,
    addrel builtin,
    baseno builtin,
    binary builtin,
    null builtin,
    rel builtin,
    substr builtin,
    unspec builtin;

%include cobol_in_token;
%include cobol_type1;
%include cobol_type2;
%include cobol_type9;
%include cobol_type10;
%include cobol_type19;
%include cobol_type30;
%include cobol_;
%include cobol_fixed_common;
%include cobol_ext_;
%include cobol_op_con;
%include cobol_type40;


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
