/* Beginning of INCLUDE file dart_catalog.incl.pl1 */

declare
	1 dartmouth_catalog based (catp) aligned,
	     2 lock bit(36) aligned,			/* prevent simultaneous use */
	     2 out_of_service_lock bit(36) aligned,	/* indicates the directory is out of service */
	     2 nentries fixed bin aligned,		/* number of entries used */
	     2 high_entry fixed bin aligned,		/* index of last entry */
	     2 time_created fixed bin(71) aligned,	/* time of creation of directory */
	     2 nsearches fixed bin aligned,		/* number of searches of the directory */
	     2 ngarbage fixed bin aligned,		/* number of garbage collections made */
	     2 entries(0:i-1 refer(high_entry)) aligned,
		3 in_use bit(1) aligned,		/* indicates entry is active */
		3 nsrch_for_here fixed bin aligned,	/* number of searches for this entry */
		3 suffix char(8) aligned,		/* .basic or .algol or .whatever (without the dot) */
		3 name char(8) aligned,		/* file name */
		3 password char(8) aligned,		/* file password*/
		3 access aligned,			/* explained below */
		     4 without_password bit(18) unal,
		     4 with_password bit(18) unal,
		3 preference fixed bin(35) aligned,	/* explained below */
		3 dates bit(36) aligned,		/* DTM and DTU for dartmouth get info from hcs_$status */
		3 word_count fixed bin(35) aligned;



/* 
Access control information is specified in 36 bits divided into two 18 bit fields.
One field is for access without a password, and one is for access with a password.

		B_I_T_	C_O_D_E_	E_X_P_L_A_N_A_T_I_O_N_

		 0	 C	catalog
		 1 	 P 	password
		 2		not used (6/16/71)
		 3 	 O	owner
		 4		not used (6/16/71)
		 5 	 X	execute permission (tra segment|0)  or  S  search permission on directory
		 6	 A	append permission
		 7	 W	write permission
		 8	 R	read permission
		 9	 L	the file is listable
		10	 S	the file is saveable
		11	 C	compile permission (runtime package name in words 2 & 3 of file)
		12	 P	public permission (re *.*.*)
		13 	 G	group permission (re *.project.*)
		14-17		system code
		18	 T	executive trap permission
		19		slave trap permission
		20		not used (6/16/71)
		21-35		same as 3-17


			S_Y_S_T_E_M_ C_O_D_E_S_

		C_O_D_E_		S_Y_S_T_E_M_

		0000
		0001		BASIC
		0010		ALGOL
		0011		FORTRAN
		0100		LISP
		0101		LAFFF
		0110		ALGOL68
		0111		not used
		1000		MIX
		1001		GEFORT
		1010		not used
		1011 		not used
		1100		not used
		1101		GMAP
		1110		TRAC
		1111		DATA


			P_R_E_F_E_R_E_N_C_E_S_

		C_O_D_E_		M_E_A_N_I_N_G_

		  1		Swap files
		  2		System files (BASIC, ALGOL, ...) or monitor scratch files
		  3		Catalogs
		  4 		Scratch files
		  5		Saved files
		  6		Infrequently accessed saved files and data
		  7		Permanent data base


End of INCLUDE file dart_catalog.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
