/* Begin fs_dev_types_sector.incl.pl1 */


/****^  HISTORY COMMENTS:
  1) change(86-04-21,Fawcett), approve(86-04-21,MCR7383),
     audit(86-05-12,Coppola), install(86-07-18,MR12.0-1098):
     Add the sector differance for devices that do 64 word IO and devices that
     do 512 word IO.
                                                   END HISTORY COMMENTS */

/* Created by R. A. Fawcett for 512 word IO. for procedures that do not
	 need all the data in fs_dev_types. This is also included in
	 fs_dev_types.incl.pl1  */

dcl  sect_per_cyl (9) fixed bin static options (constant) init /* table of # of sectors per cylinder on each device */
    (0, 760, 760, 760, 589, 360, 1280, 255, 255);

dcl  sect_per_sv (9) fixed bin (24) static options (constant) init /* table of # of sectors per cylinder on each subvolume */
     (0, 0, 0, 0, 0, 0, 0, 112710, 150450);

dcl  sect_per_rec (9) fixed bin static options (constant) init
 /* table of # of sectors per record on each device */
 /* coresponding array in disk_pack.incl.pl1 called SECTORS_PER_RECORD */
    (0, 16, 16, 16, 16, 16, 16, 2, 2);

dcl  sect_per_vtoc (9) fixed bin static options (constant) init
     (0, 3, 3, 3, 3, 3, 3, 1, 1);
	
dcl  vtoc_per_rec (9) fixed bin  static options  (constant) init
/* corespending array in disk_pack.incl.pl1 named VTOCES_PER_RECORD */
     (0, 5, 5, 5, 5, 5, 5, 2, 2);

dcl  sect_per_track (9) fixed bin static options (constant) init /* table of # of sectors per track on each device */
    (0, 40, 40, 40, 31, 18, 64, 17, 17);

dcl  words_per_sect (9) fixed bin static options (constant) init /* table of # of words per sector on each device */
    (0, 64, 64, 64, 64, 64, 64, 512, 512);

/* End fs_dev_types_sector.incl.pl1 */



*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
