	     char_string = card_image;
/* BEGIN INCLUDE FILE ... ibm2780_data.incl.pl1 ... 3/77 */

dcl  adp ptr;					/* local copy of pointer to attach data */

dcl 1 ad aligned based (adp),
    2 remote_ttt_info like remote_ttt_info,
    2 fixed,
      3 phys_line_length fixed,
      3 char_mode fixed bin,				/* translation mode ascii or ebcdic */
      3 record_len fixed bin,				/* length of output record in characters */
      3 line_length fixed bin,			/* length of printer line */
    2 bits,
      3 ht bit (1),					/* on if terminal has tab option */
      3 multi_record bit (1),				/* enable multi record mode if on */
      3 auto_turnaround bit (1),			/* enable auto turnaround if on */
      3 transparent bit (1),				/* Set if in transparent mode */
    2 ptrs,
      3 comm_iocbp ptr,				/* iocb ptr  to comm_ dim  */
    2 chars,
      3 printer_select char(2),
      3 punch_select char(2),
      3 terminal_id char (2),				/* terminal id string of terminal */
      3 device_type char (32),				/* device selection character */
      3 attach_desc char (256) var,
      3 open_description char (24) var;

dcl  ascii fixed bin int static init (1) options (constant);
dcl  ebcdic fixed bin int static init (2) options (constant);

dcl  reader char (32) static init ("reader") options (constant);	/* device name */
dcl  punch char (32) static init ("punch") options (constant);	/* device name */
dcl  special char (32) static init ("special") options (constant); /* device name */
dcl  printer char (32) static init ("printer") options (constant); /* device name */
dcl  teleprinter char (32) static init ("teleprinter") options (constant); /* device name */

dcl  HT char (1) int static options (constant) init ("	");
dcl  ENQ char (1) int static options (constant) init ("");
dcl  ESC char (1) int static options (constant) init ("");

/* END INCLUDE FILE ... ibm2780_data.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
