/* BEGIN INCLUDE FILE ... ibm3780_data.incl.pl1 ... 3/77 */

/* Reworked February 1984 by Allan Haggett for new ibm3780_. */

dcl  adp		        ptr;		         /* local copy of pointer to attach data */

dcl  1 ad		        aligned based (adp),
       2 ttt_info	        like remote_ttt_info,
       2 fixed,
         3 phys_line_length fixed,
         3 char_mode        fixed bin,		         /* translation mode ascii or ebcdic */
         3 record_len       fixed bin,		         /* length of output record in characters */
         3 line_length      fixed bin,		         /* length of printer line */
         3 multi_record_count fixed bin,	         /* If multirecord, then this is records/block. */
       2 bits,
         3 has_tabs	        bit (1),		         /* on if terminal has tab option */
         3 multi_record     bit (1),		         /* enable multi record mode if on */
         3 auto_turnaround  bit (1),		         /* enable auto turnaround if on */
         3 transparent      bit (1),		         /* Set if in transparent mode */
       2 ptrs,
         3 comm_info_ptr    pointer,
         3 cib_ptr	        pointer,		         /* Comm Info Block */
       2 chars,
         3 printer_select   char (1),
         3 punch_select     char (1),
         3 terminal_id      char (5),		         /* terminal id string of terminal */
         3 device_type      char (32),		         /* Current device type. */
         3 last_selected_device char (32),	         /* Via select_device */
         3 attach_desc      char (256) var,
         3 input_buf        char (512) var,
         3 output_buf       char (512) var,
         3 open_description char (24) var,
         3 carriage_ctl_table (4) char (4) aligned,        /* These are used by */
         3 slew_ctl_table   (6) char (4) aligned;	         /*    ibm3780_conv_. */

dcl  cib_ptr	        pointer;
dcl  1 cib	        aligned based (cib_ptr),       /* Information about the comm switch for each attachment. */
       2 device_channel     char (32),		         /* Channel name. */
       2 comm_iocb_ptr      pointer,		         /* ptr to bisync_ IOCB. */
       2 last_selected_iocb_ptr pointer,	         /* Via select_device. */
       2 n_attached	        fixed bin,		         /* Count of ibm3780_ switches attached to this one? */
       2 flags,
         3 attached_sw      bit (1) unaligned,
         3 opened_sw        bit (1) unaligned,
         3 in_quit_state_sw bit (1) unaligned,
         3 pad_flags        bit (33) unaligned,
       2 chain,				         /* Thread pointers. */
         3 next_cib_ptr     pointer,
         3 prev_cib_ptr     pointer;


dcl  ASCII	        fixed bin int static init (1) options (constant);
dcl  EBCDIC	        fixed bin int static init (2) options (constant);

/* There are three supported device types. There names: */
dcl  (PUNCH	        init ("punch"),
     PRINTER	        init ("printer"),
     TELEPRINTER	        init ("teleprinter")) char (32) internal static options (constant);


dcl  HT		        char (1) int static options (constant) init ("	");
dcl  ENQ		        char (1) int static options (constant) init ("");
dcl  ESC		        char (1) int static options (constant) init ("");

/* END INCLUDE FILE ... ibm3780_data.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
