/* BEGIN INCLUDE FILE ... mask.incl.pl1 */

dcl (	structure_mask		init("100000000000000000000000000000000000"b),
	fixed_mask		init("010000000000000000000000000000000000"b),
	float_mask		init("001000000000000000000000000000000000"b),
	bit_mask			init("000100000000000000000000000000000000"b),
	char_mask			init("000010000000000000000000000000000000"b),
	ptr_mask			init("000001000000000000000000000000000000"b),
	offset_mask		init("000000100000000000000000000000000000"b),
	area_mask			init("000000010000000000000000000000000000"b),
	label_mask		init("000000001000000000000000000000000000"b),
	entry_mask		init("000000000100000000000000000000000000"b),
	file_mask			init("000000000010000000000000000000000000"b),
	arg_descriptor_mask		init("000000000001000000000000000000000000"b),
	storage_block_mask		init("000000000000100000000000000000000000"b),
	lock_mask			init("000000000000010000000000000000000000"b),
	condition_mask		init("000000000000001000000000000000000000"b),
	format_mask		init("000000000000000100000000000000000000"b),
	builtin_mask		init("000000000000000010000000000000000000"b),
	generic_mask		init("000000000000000001000000000000000000"b),
	picture_mask		init("000000000000000000100000000000000000"b),
	dimensioned_mask		init("000000000000000000010000000000000000"b),
	initialed_mask		init("000000000000000000001000000000000000"b),
	aligned_mask		init("000000000000000000000100000000000000"b),
	unaligned_mask		init("000000000000000000000010000000000000"b),
	signed_mask		init("000000000000000000000001000000000000"b),
	unsigned_mask		init("000000000000000000000000100000000000"b),
	precision_mask		init("000000000000000000000000010000000000"b),
	varying_mask		init("000000000000000000000000001000000000"b),
	local_mask		init("000000000000000000000000000100000000"b),
	decimal_mask		init("000000000000000000000000000010000000"b),
	binary_mask		init("000000000000000000000000000001000000"b),
	real_mask			init("000000000000000000000000000000100000"b),
	complex_mask		init("000000000000000000000000000000010000"b),
	variable_mask		init("000000000000000000000000000000001000"b),
	reducible_mask		init("000000000000000000000000000000000100"b),
	irreducible_mask		init("000000000000000000000000000000000010"b),
	returns_mask		init("000000000000000000000000000000000001"b)) bit(36) aligned int static
				options(constant);

dcl (	arithmetic_mask		init("011000000000000000000000000011110000"b),
	computational_mask		init("011110000000000000100000000011110000"b),
	fixed_binary_real_mask	init("010000000000000000000000000001100000"b),
	fixed_decimal_real_mask	init("010000000000000000000000000010100000"b),
	float_decimal_real_mask	init("001000000000000000000000000010100000"b),
	fixed_decimal_complex_mask	init("010000000000000000000000000010010000"b),
	float_decimal_complex_mask	init("001000000000000000000000000010010000"b),
	string_mask		init("000110000000000000000000000000000000"b),
	undesirable_mask		init("111111111111111111100111110111110111"b),
	convert_mask		init("011111111111111111100111110111111110"b),
	declare_constant_mask	init("111111111111111111100000000011110000"b)
								     ) bit(36) aligned int static
									options(constant);

/* END INCLUDE FILE ... mask.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
