/*        BEGIN INCLUDE FILE           mrds_file_valid_out.incl.pl1

   Created October, 1978 for release in MR 7.0

   author:  O. Friesen                                                 */

dcl 1 file_valid_out based (fvo_ptr) aligned,
    2 dm_file_name char (30),				/* data model file_name as determined from dsmd */
    2 file_code fixed bin (35),			/* file code for dsm file being validated */
    2 file_access fixed bin (5),			/* file access; i.e., read or write */
    2 permit_ops fixed bin (17),			/* dsl operations permitted on the file */
    2 num_rel fixed bin,				/* nbr of relations in data submodel */
    2 rel (nbr_rel_alloc refer (file_valid_out.num_rel)),
      3 dsm_rel_name char (32),			/* data submodel relation name */
      3 dm_rel_name char (32),			/* data model relation name */
      3 rel_code fixed bin (35);			/* relation code  */

dcl  nbr_rel_alloc fixed bin;

dcl fvo_ptr ptr;

/*         END INCUDE FILE             mrds_file_valid_out.incl.pl1 */



*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
