/*  BEGIN INCLUDE FILE ... uc_validate_info.incl.pl1 */

/****^  HISTORY COMMENTS:
  1) change(87-05-14,GDixon), approve(87-07-13,MCR7737),
     audit(87-07-16,Brunelle), install(87-08-04,MR12.1-1056):
      A) Explicitly declare pad fields.
      B) Remove channel_info.line_type, since that is now stored in
         ute.line_type.
      C) Shift declarations to reduce padding needed for doubleword aligned
         values.
                                                   END HISTORY COMMENTS */

/* format: style4,indattr */

dcl  uc_validate_info_ptr   ptr automatic;

dcl  1 uc_validate_info     structure aligned
		        based (uc_validate_info_ptr),
       2 input_info,
         3 channel_info,
	 4 access_class_range (2) bit (72),
         3 password	        char (32) unaligned,
         3 flags	        aligned,
	 4 check_channel_access bit (1) unaligned,
	 4 check_anonymous_password bit (1) unaligned,
	 4 pad1	        bit (36 - 2) unaligned,
       2 output_info,
         3 flags	        aligned,
	 4 password_expired bit (1) unaligned,
	 4 password_unused_too_long bit (1) unaligned,
	 4 changed_password bit (1) unaligned,
	 4 changed_default_project bit (1) unaligned,
	 4 default_authorization_changed bit (1) unaligned,
	 4 pad2	        bit (36 - 5) unaligned,
         3 number_disconnected_processes fixed bin,
         3 pad3 	        fixed bin,
         3 password_interval fixed bin (71),
         3 last_bad_pw_info,
	 4 time	        fixed bin (71),
	 4 terminal_type  char (32) unaligned,
	 4 terminal_id    char (4) unaligned,
	 4 line_type      fixed bin,
	 4 number	        fixed bin,
	 4 pad4	        fixed bin,
         3 last_login_info,
	 4 time	        fixed bin (71),
	 4 terminal_type  char (32) unaligned,
	 4 terminal_id    char (4) unaligned,
	 4 line_type      fixed bin;

/*  END INCLUDE FILE ... uc_validate_info.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
