/* BEGIN INCLUDE   vrm_cursor.incl.pl1		*/

/* 83-05-26 Roger Lackey : Modifyed for relation cursors */

dcl  vrm_cursor_ptr pointer;				/* Pointer to this structure */

dcl 1 vrm_cursor aligned based (vrm_cursor_ptr),		/* vfile relation manager cursor */
    2 opening_id bit (36) aligned,			/* ID of opening associated with this cursor */
    2 debug_sw unal,				/* Undefined MBZ */
      3 trace_open bit (1) unal,			/* Show opening of iocb cursor creation time */
      3 pad bit (35) unal,
    2 switches,
      3 shared bit (1) unal,				/* Other processes can use this relation */
      3 meter_sw bit (1) unal,			/* On = Keep meters for this cursor */
      3 pad bit (7) unal,				/* Unsed */
    2 opening_mode fixed bin,				/* Opening mode for this cursor (8 = KSQR  10 = KSQU) */
    2 open_info_ptr pointer,				/* Pointer to parent opening info structure */
    2 vrm_relation_desc_ptr pointer,			/* Pointer to parent rel desc */
    2 iocb_ptr pointer,				/* Pointer to attach iocb */
    2 secondary_iocb_ptr ptr,				/* Second iocb_ptr used by vrmu_search */
    2 search_list_ptr ptr,				/* Pointer to search_list */
    2 search_keys_ptr ptr,				/* Pointer to search_keys array */
    2 meter_ptr pointer,				/* Pointer metering str if metering is on or null */
    2 vrm_iocb_list_block_ptr pointer,			/* Pointer to vrm_iocb_list_block that contains this cursors iocb */
    2 vrm_iocb_list_block_iocbs_ix fixed bin;		/* Index into list_block.iocbs for location of iocb */


/* END  INCLUDE vrm_cursor.incl.pl1	                  */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
