/* BEGIN vrm_key_list.incl.pl1 -- jaw, 1/17/79 */

dcl 1 key_list aligned based (key_list_ptr),		/* list of keys for add_key or delete_key */
    2 number_of_keys fixed bin,			/* no. keys in list */
    2 key_info (kl_number_of_keys refer (key_list.number_of_keys)),
      3 item_index fixed bin,				/* attr. index or plink index */
      3 cand_key bit (1) unal,			/* on if key is for candidate key */
      3 unique_val bit (1) unal,			/* on if value must be unique */
      3 pad bit (34) unal,
      3 vf_info,					/* info for vfile control orders */
        4 input_key bit (1) unal,			/* if key val supplied */
        4 input_desc bit (1) unal,			/* if desc. supplied */
        4 reserved bit (34) unal,
        4 vf_desc,					/* vfile_ descriptor */
	5 comp_no fixed bin (17) unal,
	5 offset bit (18) unal,
        4 key char (256) var;

dcl  key_list_ptr ptr;
dcl  kl_number_of_keys fixed bin;

/* END vrm_key_list.incl.pl1 */


*/
                                          -----------------------------------------------------------


Historical Background

This edition of the Multics software materials and documentation is provided and donated
to Massachusetts Institute of Technology by Group Bull including Bull HN Information Systems Inc. 
as a contribution to computer science knowledge.  
This donation is made also to give evidence of the common contributions of Massachusetts Institute of Technology,
Bell Laboratories, General Electric, Honeywell Information Systems Inc., Honeywell Bull Inc., Groupe Bull
and Bull HN Information Systems Inc. to the development of this operating system. 
Multics development was initiated by Massachusetts Institute of Technology Project MAC (1963-1970),
renamed the MIT Laboratory for Computer Science and Artificial Intelligence in the mid 1970s, under the leadership
of Professor Fernando Jose Corbato. Users consider that Multics provided the best software architecture for 
managing computer hardware properly and for executing programs. Many subsequent operating systems 
incorporated Multics principles.
Multics was distributed in 1975 to 2000 by Group Bull in Europe , and in the U.S. by Bull HN Information Systems Inc., 
as successor in interest by change in name only to Honeywell Bull Inc. and Honeywell Information Systems Inc. .

                                          -----------------------------------------------------------

Permission to use, copy, modify, and distribute these programs and their documentation for any purpose and without
fee is hereby granted,provided that the below copyright notice and historical background appear in all copies
and that both the copyright notice and historical background and this permission notice appear in supporting
documentation, and that the names of MIT, HIS, Bull or Bull HN not be used in advertising or publicity pertaining
to distribution of the programs without specific prior written permission.
    Copyright 1972 by Massachusetts Institute of Technology and Honeywell Information Systems Inc.
    Copyright 2006 by Bull HN Information Systems Inc.
    Copyright 2006 by Bull SAS
    All Rights Reserved

*/
